In [4]:
import pandas as pd
import numpy as np
pd.__version__

'1.3.4'

In [5]:
#판다스의 시리즈 객체
s = pd.Series([0,0.25,0.5,0.75,1.0])
s

0    0.00
1    0.25
2    0.50
3    0.75
4    1.00
dtype: float64

In [6]:
s.values

array([0.  , 0.25, 0.5 , 0.75, 1.  ])

In [7]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
s[1]

0.25

In [9]:
s[1:4]

1    0.25
2    0.50
3    0.75
dtype: float64

In [11]:
s = pd.Series([0,0.25,0.5,0.75,1.0],
             index=['a','b','c','d','e']) #시리즈 생성 -(배열 - 배열) or (튜플)
s

a    0.00
b    0.25
c    0.50
d    0.75
e    1.00
dtype: float64

In [12]:
s['c']

0.5

In [14]:
s[['c','d','e']] #여러개를 가져오고 싶으면 괄호 2개

c    0.50
d    0.75
e    1.00
dtype: float64

In [16]:
'b' in s

True

In [18]:
s = pd.Series([0,0.25,0.5,0.75,1.0],
             index=[2,4,6,8,10])
s

2     0.00
4     0.25
6     0.50
8     0.75
10    1.00
dtype: float64

In [19]:
s[2:]

6     0.50
8     0.75
10    1.00
dtype: float64

In [20]:
s.unique() #고유한 값만 출력해준다

array([0.  , 0.25, 0.5 , 0.75, 1.  ])

In [22]:
s.value_counts() #값들의 개수

0.00    1
0.25    1
0.50    1
0.75    1
1.00    1
dtype: int64

In [23]:
s.isin([0.25,0.75]) #정해준 값들의 위치 부울 결과를 반환

2     False
4      True
6     False
8      True
10    False
dtype: bool

In [25]:
pop_tuple = {'서울특별시':9720846,
            '부산광역시':3404423,
            '인천광역시':2947217,
            '대구광역시':2427954,
            '대전광역시':1471040,
            '광주광역시':1455048}
population = pd.Series(pop_tuple)
population

서울특별시    9720846
부산광역시    3404423
인천광역시    2947217
대구광역시    2427954
대전광역시    1471040
광주광역시    1455048
dtype: int64

In [26]:
population['서울특별시']

9720846

In [27]:
population['서울특별시':'인천광역시']

서울특별시    9720846
부산광역시    3404423
인천광역시    2947217
dtype: int64

In [28]:
###DataFrame 객체

In [30]:
pd.DataFrame([{'A':2,'B':4,'D':3},{'A':4,'B':5,'C':7}])

   A  B    D    C
0  2  4  3.0  NaN
1  4  5  NaN  7.0

In [33]:
pd.DataFrame(np.random.rand(5,5),
             columns=['A','B','C','D','E'],
            index=[1,2,3,4,5])

          A         B         C         D         E
1  0.422617  0.489148  0.320411  0.175871  0.357560
2  0.713004  0.768261  0.256761  0.275275  0.347848
3  0.451801  0.551185  0.272478  0.743312  0.443868
4  0.320880  0.177872  0.275508  0.788633  0.176504
5  0.592496  0.990495  0.345941  0.584121  0.204939

In [34]:
male_tuple = {'서울특별시':4732275,
            '부산광역시':1668618,
            '인천광역시':1476813,
            '대구광역시':1198815,
            '대전광역시':734441,
            '광주광역시':720060}
male = pd.Series(male_tuple)
male

서울특별시    4732275
부산광역시    1668618
인천광역시    1476813
대구광역시    1198815
대전광역시     734441
광주광역시     720060
dtype: int64

In [36]:
female_tuple = {'서울특별시':4988571,
            '부산광역시':1735805,
            '인천광역시':1470404,
            '대구광역시':1229139,
            '대전광역시':736999,
            '광주광역시':734988}
female = pd.Series(female_tuple)
female

서울특별시    4988571
부산광역시    1735805
인천광역시    1470404
대구광역시    1229139
대전광역시     736999
광주광역시     734988
dtype: int64

In [37]:
#3개의 Series를 하나의 데이터프레임으로 만들었다
korea_df = pd.DataFrame({'인구수':population,
                        '남자인구수':male,
                        '여자인구수':female})
korea_df

           인구수    남자인구수    여자인구수
서울특별시  9720846  4732275  4988571
부산광역시  3404423  1668618  1735805
인천광역시  2947217  1476813  1470404
대구광역시  2427954  1198815  1229139
대전광역시  1471040   734441   736999
광주광역시  1455048   720060   734988

In [38]:
korea_df.index

Index(['서울특별시', '부산광역시', '인천광역시', '대구광역시', '대전광역시', '광주광역시'], dtype='object')

In [39]:
korea_df.columns

Index(['인구수', '남자인구수', '여자인구수'], dtype='object')

In [40]:
korea_df['여자인구수'] #지정인덱싱 할때는 열기준으로 하네요!

서울특별시    4988571
부산광역시    1735805
인천광역시    1470404
대구광역시    1229139
대전광역시     736999
광주광역시     734988
Name: 여자인구수, dtype: int64

In [41]:
korea_df['서울특별시':'인천광역시']

           인구수    남자인구수    여자인구수
서울특별시  9720846  4732275  4988571
부산광역시  3404423  1668618  1735805
인천광역시  2947217  1476813  1470404

In [42]:
##index 객체

In [176]:
idx = pd.Index([2,4,6,8,10])
idx

Int64Index([2, 4, 6, 8, 10], dtype='int64')

In [44]:
idx[1]

4

In [46]:
idx[1:2:2]

Int64Index([4], dtype='int64')

In [47]:
idx[-1::]

Int64Index([10], dtype='int64')

In [48]:
idx[::2]

Int64Index([2, 6, 10], dtype='int64')

In [49]:
print(idx)
print(idx.size)
print(idx.shape)
print(idx.ndim)
print(idx.dtype)

Int64Index([2, 4, 6, 8, 10], dtype='int64')
5
(5,)
1
int64

In [60]:
#인덱스 객체는 약간 집합 느낌이라고 하셨었죵
idx1=pd.Index([1,2,4,6,8])
idx2=pd.Index([2,4,5,6,7])
print(idx1.append(idx2))
print(idx1.difference(idx2)) #차집합
print(idx1-idx2) #빼기 연산
print(idx1.intersection(idx2))
print(idx1 & idx2)
print(idx1.union(idx2))
print(idx1 | idx2)
print(idx1.delete(0)) #첫번째 값을 뺀다
print(idx1)
print(idx1.drop(1))
print(idx1 ^ idx2)

Int64Index([1, 2, 4, 6, 8, 2, 4, 5, 6, 7], dtype='int64')
Int64Index([1, 8], dtype='int64')
Int64Index([-1, -2, -1, 0, 1], dtype='int64')
Int64Index([2, 4, 6], dtype='int64')
Int64Index([2, 4, 6], dtype='int64')
Int64Index([1, 2, 4, 5, 6, 7, 8], dtype='int64')
Int64Index([1, 2, 4, 5, 6, 7, 8], dtype='int64')
Int64Index([2, 4, 6, 8], dtype='int64')
Int64Index([1, 2, 4, 6, 8], dtype='int64')
Int64Index([2, 4, 6, 8], dtype='int64')
Int64Index([1, 5, 7, 8], dtype='int64')

C:\Users\zmzm1\miniconda3\lib\site-packages\ipykernel_launcher.py:7: FutureWarning: Index.__and__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__and__.  Use index.intersection(other) instead
  import sys
C:\Users\zmzm1\miniconda3\lib\site-packages\ipykernel_launcher.py:9: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead
  if __name__ == '__main__':
C:\Users\zmzm1\miniconda3\lib\site-packages\ipykernel_launcher.py:13: FutureWarning: Index.__xor__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__xor__.  Use index.symmetric_difference(other) instead
  del sys.path[0]

In [61]:
s= pd.Series([0,0.25,0.5,0.75,1.0],
             index=['a','b','c','d','e'])
s

a    0.00
b    0.25
c    0.50
d    0.75
e    1.00
dtype: float64

In [62]:
s['b']

0.25

In [63]:
'b' in s

True

In [64]:
s.keys()

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [66]:
#s.items() zip형태로 반환된다
list(s.items())

[('a', 0.0), ('b', 0.25), ('c', 0.5), ('d', 0.75), ('e', 1.0)]

In [67]:
s['f']=1.25 #시리즈에 값 추가
s

a    0.00
b    0.25
c    0.50
d    0.75
e    1.00
f    1.25
dtype: float64

In [68]:
s['a':'d']

a    0.00
b    0.25
c    0.50
d    0.75
dtype: float64

In [69]:
s[0:4]

a    0.00
b    0.25
c    0.50
d    0.75
dtype: float64

In [70]:
s[(s>0.4) & (s<0.8)]

c    0.50
d    0.75
dtype: float64

In [71]:
s[['a','c','e']]

a    0.0
c    0.5
e    1.0
dtype: float64

In [73]:
s = pd.Series(['a','b','c','d','e'],
             index=[1,3,5,7,9])
s

1    a
3    b
5    c
7    d
9    e
dtype: object

In [74]:
s[1]

'a'

In [75]:
s[2:4]

5    c
7    d
dtype: object

In [76]:
s.iloc[1] #0부터 시작하는 정수 인덱싱 사용

'b'

In [77]:
s.iloc[2:4]

5    c
7    d
dtype: object

In [78]:
s.reindex((range(10)))

0    NaN
1      a
2    NaN
3      b
4    NaN
5      c
6    NaN
7      d
8    NaN
9      e
dtype: object

In [80]:
s.reindex(range(10),method='bfill') #누락값들을 이전 값들로 채워준다

0    a
1    a
2    b
3    b
4    c
5    c
6    d
7    d
8    e
9    e
dtype: object

In [81]:
korea_df

           인구수    남자인구수    여자인구수
서울특별시  9720846  4732275  4988571
부산광역시  3404423  1668618  1735805
인천광역시  2947217  1476813  1470404
대구광역시  2427954  1198815  1229139
대전광역시  1471040   734441   736999
광주광역시  1455048   720060   734988

In [82]:
korea_df['남자인구수']

서울특별시    4732275
부산광역시    1668618
인천광역시    1476813
대구광역시    1198815
대전광역시     734441
광주광역시     720060
Name: 남자인구수, dtype: int64

In [83]:
korea_df.남자인구수 #편리하게 메서드 형태로 가져올 수 있다

서울특별시    4732275
부산광역시    1668618
인천광역시    1476813
대구광역시    1198815
대전광역시     734441
광주광역시     720060
Name: 남자인구수, dtype: int64

In [84]:
korea_df.여자인구수

서울특별시    4988571
부산광역시    1735805
인천광역시    1470404
대구광역시    1229139
대전광역시     736999
광주광역시     734988
Name: 여자인구수, dtype: int64

In [85]:
korea_df['남여비율'] = (korea_df['남자인구수']*100/korea_df['여자인구수'])

In [86]:
korea_df

           인구수    남자인구수    여자인구수        남여비율
서울특별시  9720846  4732275  4988571   94.862336
부산광역시  3404423  1668618  1735805   96.129346
인천광역시  2947217  1476813  1470404  100.435867
대구광역시  2427954  1198815  1229139   97.532907
대전광역시  1471040   734441   736999   99.652917
광주광역시  1455048   720060   734988   97.968946

In [87]:
korea_df.values

array([[9.72084600e+06, 4.73227500e+06, 4.98857100e+06, 9.48623363e+01],
       [3.40442300e+06, 1.66861800e+06, 1.73580500e+06, 9.61293463e+01],
       [2.94721700e+06, 1.47681300e+06, 1.47040400e+06, 1.00435867e+02],
       [2.42795400e+06, 1.19881500e+06, 1.22913900e+06, 9.75329072e+01],
       [1.47104000e+06, 7.34441000e+05, 7.36999000e+05, 9.96529168e+01],
       [1.45504800e+06, 7.20060000e+05, 7.34988000e+05, 9.79689464e+01]])

In [88]:
korea_df.T

,서울특별시,부산광역시,인천광역시,대구광역시,대전광역시,광주광역시
인구수,9.720846e+06,3.404423e+06,2.947217e+06,2.427954e+06,1.471040e+06,1.455048e+06
남자인구수,4.732275e+06,1.668618e+06,1.476813e+06,1.198815e+06,7.344410e+05,7.200600e+05
여자인구수,4.988571e+06,1.735805e+06,1.470404e+06,1.229139e+06,7.369990e+05,7.349880e+05
남여비율,9.486234e+01,9.612935e+01,1.004359e+02,9.753291e+01,9.965292e+01,9.796895e+01

In [89]:
korea_df.values[0] #서울특별시만 가져왔다

array([9.72084600e+06, 4.73227500e+06, 4.98857100e+06, 9.48623363e+01])

In [90]:
korea_df['인구수']

서울특별시    9720846
부산광역시    3404423
인천광역시    2947217
대구광역시    2427954
대전광역시    1471040
광주광역시    1455048
Name: 인구수, dtype: int64

In [91]:
korea_df.loc[:'인천광역시',"남자인구수"]

서울특별시    4732275
부산광역시    1668618
인천광역시    1476813
Name: 남자인구수, dtype: int64

In [92]:
korea_df.loc[korea_df.여자인구수 > 1000000]

           인구수    남자인구수    여자인구수        남여비율
서울특별시  9720846  4732275  4988571   94.862336
부산광역시  3404423  1668618  1735805   96.129346
인천광역시  2947217  1476813  1470404  100.435867
대구광역시  2427954  1198815  1229139   97.532907

In [93]:
korea_df.loc[(korea_df.인구수 < 2000000)]

           인구수   남자인구수   여자인구수       남여비율
대전광역시  1471040  734441  736999  99.652917
광주광역시  1455048  720060  734988  97.968946

In [94]:
korea_df.loc[(korea_df.인구수 > 2500000)]

           인구수    남자인구수    여자인구수        남여비율
서울특별시  9720846  4732275  4988571   94.862336
부산광역시  3404423  1668618  1735805   96.129346
인천광역시  2947217  1476813  1470404  100.435867

In [95]:
korea_df.loc[korea_df.남여비율 > 100]

           인구수    남자인구수    여자인구수        남여비율
인천광역시  2947217  1476813  1470404  100.435867

In [96]:
#조건을 결합해서 인덱싱
korea_df.loc[(korea_df.인구수 > 2500000) & (korea_df.남여비율 > 100)]

           인구수    남자인구수    여자인구수        남여비율
인천광역시  2947217  1476813  1470404  100.435867

In [97]:
korea_df.iloc[:3,:2]

           인구수    남자인구수
서울특별시  9720846  4732275
부산광역시  3404423  1668618
인천광역시  2947217  1476813

In [98]:
###다중 인덱싱

In [99]:
korea_df

           인구수    남자인구수    여자인구수        남여비율
서울특별시  9720846  4732275  4988571   94.862336
부산광역시  3404423  1668618  1735805   96.129346
인천광역시  2947217  1476813  1470404  100.435867
대구광역시  2427954  1198815  1229139   97.532907
대전광역시  1471040   734441   736999   99.652917
광주광역시  1455048   720060   734988   97.968946

In [101]:
idx_tuples =[('서울특별시',2010),('서울특별시',2020),
            ('부산광역시',2010),('부산광역시',2020),
            ('인천광역시',2010),('인천광역시',2020),
            ('대구광역시',2010),('대구광역시',2020),
            ('대전광역시',2010),('대전광역시',2020),
            ('광주광역시',2010),('광주광역시',2020)]
idx_tuples

[('서울특별시', 2010),
 ('서울특별시', 2020),
 ('부산광역시', 2010),
 ('부산광역시', 2020),
 ('인천광역시', 2010),
 ('인천광역시', 2020),
 ('대구광역시', 2010),
 ('대구광역시', 2020),
 ('대전광역시', 2010),
 ('대전광역시', 2020),
 ('광주광역시', 2010),
 ('광주광역시', 2020)]

In [102]:
pop_tuples = [10312545,9720846,
             2567910,3404423,
             2758296,2947217,
             2511676,2427954,
             1503664,1471040,
             1454636,1455048]
population = pd.Series(pop_tuples,index=idx_tuples)
population

(서울특별시, 2010)    10312545
(서울특별시, 2020)     9720846
(부산광역시, 2010)     2567910
(부산광역시, 2020)     3404423
(인천광역시, 2010)     2758296
(인천광역시, 2020)     2947217
(대구광역시, 2010)     2511676
(대구광역시, 2020)     2427954
(대전광역시, 2010)     1503664
(대전광역시, 2020)     1471040
(광주광역시, 2010)     1454636
(광주광역시, 2020)     1455048
dtype: int64

In [105]:
#MultiIndex.from_tuples로 멀티인덱스 생성(or from_array)
midx = pd.MultiIndex.from_tuples(idx_tuples)
midx

MultiIndex([('서울특별시', 2010),
            ('서울특별시', 2020),
            ('부산광역시', 2010),
            ('부산광역시', 2020),
            ('인천광역시', 2010),
            ('인천광역시', 2020),
            ('대구광역시', 2010),
            ('대구광역시', 2020),
            ('대전광역시', 2010),
            ('대전광역시', 2020),
            ('광주광역시', 2010),
            ('광주광역시', 2020)],
           )

In [107]:
population = population.reindex(midx)
population

서울특별시  2010    10312545
       2020     9720846
부산광역시  2010     2567910
       2020     3404423
인천광역시  2010     2758296
       2020     2947217
대구광역시  2010     2511676
       2020     2427954
대전광역시  2010     1503664
       2020     1471040
광주광역시  2010     1454636
       2020     1455048
dtype: int64

In [182]:
population['대전광역시',2010]

1503664

In [108]:
population[:,2010]

서울특별시    10312545
부산광역시     2567910
인천광역시     2758296
대구광역시     2511676
대전광역시     1503664
광주광역시     1454636
dtype: int64

In [109]:
population['대전광역시',:]

2010    1503664
2020    1471040
dtype: int64

In [111]:
#멀티인덱스 형태의 자료를 일반적인 데이터 프레임으로 바꿔준다
korea_mdf = population.unstack()
korea_mdf

           2010     2020
광주광역시   1454636  1455048
대구광역시   2511676  2427954
대전광역시   1503664  1471040
부산광역시   2567910  3404423
서울특별시  10312545  9720846
인천광역시   2758296  2947217

In [112]:
korea_mdf.stack()

광주광역시  2010     1454636
       2020     1455048
대구광역시  2010     2511676
       2020     2427954
대전광역시  2010     1503664
       2020     1471040
부산광역시  2010     2567910
       2020     3404423
서울특별시  2010    10312545
       2020     9720846
인천광역시  2010     2758296
       2020     2947217
dtype: int64

In [115]:
male_tuples = [511259,4732275,
             1773170,1668618,
             1390356,1476813,
             12552455,1198815,
             753648,734441,
             721780,720060]
male_tuples

[511259,
 4732275,
 1773170,
 1668618,
 1390356,
 1476813,
 12552455,
 1198815,
 753648,
 734441,
 721780,
 720060]

In [116]:
korea_mdf = pd.DataFrame({'총인구수':population,
                        '남자인구수':male_tuples})
korea_mdf

                총인구수     남자인구수
서울특별시 2010  10312545    511259
      2020   9720846   4732275
부산광역시 2010   2567910   1773170
      2020   3404423   1668618
인천광역시 2010   2758296   1390356
      2020   2947217   1476813
대구광역시 2010   2511676  12552455
      2020   2427954   1198815
대전광역시 2010   1503664    753648
      2020   1471040    734441
광주광역시 2010   1454636    721780
      2020   1455048    720060

In [117]:
female_tuples = [5201286,4988571,
                1794740,1735805,
                1367940,1470404,
                1256431,1229139,
                750016,736599,
                732856,734988]
female_tuples

[5201286,
 4988571,
 1794740,
 1735805,
 1367940,
 1470404,
 1256431,
 1229139,
 750016,
 736599,
 732856,
 734988]

In [121]:
korea_mdf = pd.DataFrame({'총인구수':population,
                          '남자인구수':male_tuples,
                         '여자인구수':female_tuples})
korea_mdf

                총인구수     남자인구수    여자인구수
서울특별시 2010  10312545    511259  5201286
      2020   9720846   4732275  4988571
부산광역시 2010   2567910   1773170  1794740
      2020   3404423   1668618  1735805
인천광역시 2010   2758296   1390356  1367940
      2020   2947217   1476813  1470404
대구광역시 2010   2511676  12552455  1256431
      2020   2427954   1198815  1229139
대전광역시 2010   1503664    753648   750016
      2020   1471040    734441   736599
광주광역시 2010   1454636    721780   732856
      2020   1455048    720060   734988

In [123]:
ratio = korea_mdf['남자인구수']*100 / korea_mdf['여자인구수']
ratio

서울특별시  2010      9.829473
       2020     94.862336
부산광역시  2010     98.798155
       2020     96.129346
인천광역시  2010    101.638668
       2020    100.435867
대구광역시  2010    999.056454
       2020     97.532907
대전광역시  2010    100.484256
       2020     99.707032
광주광역시  2010     98.488653
       2020     97.968946
dtype: float64

In [125]:
ratio.unstack()

             2010        2020
광주광역시   98.488653   97.968946
대구광역시  999.056454   97.532907
대전광역시  100.484256   99.707032
부산광역시   98.798155   96.129346
서울특별시    9.829473   94.862336
인천광역시  101.638668  100.435867

In [124]:
korea_mdf = pd.DataFrame({'총인구수':population,
                          '남자인구수':male_tuples,
                         '여자인구수':female_tuples,
                         '남여비율':ratio})
korea_mdf

                총인구수     남자인구수    여자인구수        남여비율
서울특별시 2010  10312545    511259  5201286    9.829473
      2020   9720846   4732275  4988571   94.862336
부산광역시 2010   2567910   1773170  1794740   98.798155
      2020   3404423   1668618  1735805   96.129346
인천광역시 2010   2758296   1390356  1367940  101.638668
      2020   2947217   1476813  1470404  100.435867
대구광역시 2010   2511676  12552455  1256431  999.056454
      2020   2427954   1198815  1229139   97.532907
대전광역시 2010   1503664    753648   750016  100.484256
      2020   1471040    734441   736599   99.707032
광주광역시 2010   1454636    721780   732856   98.488653
      2020   1455048    720060   734988   97.968946

In [126]:
#데이터프레임을 만들때부터 다중인덱스 선택
df = pd.DataFrame(np.random.rand(6,3),
                 index=[['a','a','b','b','c','c'],[1,2,1,2,1,2]],
                 columns=['c1','c2','c3'])
df

           c1        c2        c3
a 1  0.897245  0.716283  0.751802
  2  0.774048  0.132642  0.699967
b 1  0.408809  0.156227  0.534400
  2  0.089974  0.855715  0.740489
c 1  0.843460  0.112001  0.954631
  2  0.715454  0.795476  0.685929

In [129]:
#from_arrays - 대상이 배열일때 다중 인덱스 생성
pd.MultiIndex.from_arrays([['a','a','b','b','c','c'],[1,2,1,2,1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2)],
           )

In [131]:
#from_tupels - 대상이 튜플일때 다중인덱스 생성
pd.MultiIndex.from_tuples([('a',1),('a',2),('b',1),('b',2),('c',1),('c',2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2)],
           )

In [132]:
#from_product - 인덱스의 곱끼리 다중인덱스 생성
pd.MultiIndex.from_product([['a','b','c'],[1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2)],
           )

In [133]:
#인덱스의 위치값으로 다중인덱스 생성
pd.MultiIndex(levels=[['a','b','c'],[1,2]],
             codes=[[0,0,1,1,2,2],[0,1,0,1,0,1]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2)],
           )

In [134]:
population

서울특별시  2010    10312545
       2020     9720846
부산광역시  2010     2567910
       2020     3404423
인천광역시  2010     2758296
       2020     2947217
대구광역시  2010     2511676
       2020     2427954
대전광역시  2010     1503664
       2020     1471040
광주광역시  2010     1454636
       2020     1455048
dtype: int64

In [135]:
population.index.names=['행정구역','년도']
population

행정구역   년도
서울특별시  2010    10312545
       2020     9720846
부산광역시  2010     2567910
       2020     3404423
인천광역시  2010     2758296
       2020     2947217
대구광역시  2010     2511676
       2020     2427954
대전광역시  2010     1503664
       2020     1471040
광주광역시  2010     1454636
       2020     1455048
dtype: int64

In [139]:
idx = pd.MultiIndex.from_product([['a','b','c'],[1,2]],
                                names=['name1','name2'])
cols = pd.MultiIndex.from_product([['c1','c2','c3'],[1,2]],
                                 names=['col_ name1','col_name2'])
data=np.round(np.random.randn(6,6),2)
mdf = pd.DataFrame(data,index=idx,columns=cols)
mdf

col_name1      c1          c2          c3
col_name2       1     2     1     2     1     2
name1 name2
a     1     -1.50  0.89  1.26  0.19 -1.88  1.47
      2      0.88 -1.48  0.07  0.59  0.07  0.71
b     1      1.61 -0.08  2.07  0.44  0.44  0.44
      2     -0.09  0.81  0.19 -1.84 -1.36  0.63
c     1     -0.56 -0.16  0.90  0.97 -1.17  0.13
      2     -0.53 -0.63 -1.27 -0.01  0.46 -0.21

In [140]:
mdf['c2']

col_name2       1     2
name1 name2
a     1      1.26  0.19
      2      0.07  0.59
b     1      2.07  0.44
      2      0.19 -1.84
c     1      0.90  0.97
      2     -1.27 -0.01

In [141]:
population

행정구역   년도
서울특별시  2010    10312545
       2020     9720846
부산광역시  2010     2567910
       2020     3404423
인천광역시  2010     2758296
       2020     2947217
대구광역시  2010     2511676
       2020     2427954
대전광역시  2010     1503664
       2020     1471040
광주광역시  2010     1454636
       2020     1455048
dtype: int64

In [142]:
population['인천광역시',2010]

2758296

In [143]:
population[:,2010]

행정구역
서울특별시    10312545
부산광역시     2567910
인천광역시     2758296
대구광역시     2511676
대전광역시     1503664
광주광역시     1454636
dtype: int64

In [144]:
population[population > 3000000]

행정구역   년도
서울특별시  2010    10312545
       2020     9720846
부산광역시  2020     3404423
dtype: int64

In [145]:
population[['대구광역시','대전광역시']]

행정구역   년도
대구광역시  2010    2511676
       2020    2427954
대전광역시  2010    1503664
       2020    1471040
dtype: int64

In [146]:
mdf

col_name1      c1          c2          c3
col_name2       1     2     1     2     1     2
name1 name2
a     1     -1.50  0.89  1.26  0.19 -1.88  1.47
      2      0.88 -1.48  0.07  0.59  0.07  0.71
b     1      1.61 -0.08  2.07  0.44  0.44  0.44
      2     -0.09  0.81  0.19 -1.84 -1.36  0.63
c     1     -0.56 -0.16  0.90  0.97 -1.17  0.13
      2     -0.53 -0.63 -1.27 -0.01  0.46 -0.21

In [147]:
mdf['c2',1] #명시적인 인덱스 참조, 이땐 열을 참조한다

name1  name2
a      1        1.26
       2        0.07
b      1        2.07
       2        0.19
c      1        0.90
       2       -1.27
Name: (c2, 1), dtype: float64

In [161]:
mdf.loc['a'] #loc을 사용하면 행에서도 참조가능

col_name1    c1          c2          c3
col_name2     1     2     1     2     1     2
name2
1         -1.50  0.89  1.26  0.19 -1.88  1.47
2          0.88 -1.48  0.07  0.59  0.07  0.71

In [187]:
mdf.loc[:,'c2']

col_name2       1     2
name1 name2
a     1      1.26  0.19
      2      0.07  0.59
b     1      2.07  0.44
      2      0.19 -1.84
c     1      0.90  0.97
      2     -1.27 -0.01

In [186]:
mdf.loc[:,('c2',1)]

name1  name2
a      1        1.26
       2        0.07
b      1        2.07
       2        0.19
c      1        0.90
       2       -1.27
Name: (c2, 1), dtype: float64

In [148]:
mdf.iloc[:3,:4]

col_name1      c1          c2
col_name2       1     2     1     2
name1 name2
a     1     -1.50  0.89  1.26  0.19
      2      0.88 -1.48  0.07  0.59
b     1      1.61 -0.08  2.07  0.44

In [151]:
mdf.loc[:,('c2',1)]

name1  name2
a      1        1.26
       2        0.07
b      1        2.07
       2        0.19
c      1        0.90
       2       -1.27
Name: (c2, 1), dtype: float64

In [155]:
idx_slice=pd.IndexSlice
mdf.loc[idx_slice[:,2],idx_slice[:,2]]

col_name1      c1    c2    c3
col_name2       2     2     2
name1 name2
a     2     -1.48  0.59  0.71
b     2      0.81 -1.84  0.63
c     2     -0.63 -0.01 -0.21

In [156]:
idx

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2)],
           names=['name1', 'name2'])

In [157]:
korea_mdf

                총인구수     남자인구수    여자인구수        남여비율
행정구역  년도
서울특별시 2010  10312545    511259  5201286    9.829473
      2020   9720846   4732275  4988571   94.862336
부산광역시 2010   2567910   1773170  1794740   98.798155
      2020   3404423   1668618  1735805   96.129346
인천광역시 2010   2758296   1390356  1367940  101.638668
      2020   2947217   1476813  1470404  100.435867
대구광역시 2010   2511676  12552455  1256431  999.056454
      2020   2427954   1198815  1229139   97.532907
대전광역시 2010   1503664    753648   750016  100.484256
      2020   1471040    734441   736599   99.707032
광주광역시 2010   1454636    721780   732856   98.488653
      2020   1455048    720060   734988   97.968946

In [163]:
#korea_mdf['서울특별시':'인천광역시'] #인덱스가 정렬되지 않아서 오류 발생
korea_mdf = korea_mdf.sort_index()
korea_mdf

                총인구수     남자인구수    여자인구수        남여비율
행정구역  년도
광주광역시 2010   1454636    721780   732856   98.488653
      2020   1455048    720060   734988   97.968946
대구광역시 2010   2511676  12552455  1256431  999.056454
      2020   2427954   1198815  1229139   97.532907
대전광역시 2010   1503664    753648   750016  100.484256
      2020   1471040    734441   736599   99.707032
부산광역시 2010   2567910   1773170  1794740   98.798155
      2020   3404423   1668618  1735805   96.129346
서울특별시 2010  10312545    511259  5201286    9.829473
      2020   9720846   4732275  4988571   94.862336
인천광역시 2010   2758296   1390356  1367940  101.638668
      2020   2947217   1476813  1470404  100.435867

In [164]:
korea_mdf['서울특별시':'인천광역시'] #정렬돼서 오류 X

                총인구수    남자인구수    여자인구수        남여비율
행정구역  년도
서울특별시 2010  10312545   511259  5201286    9.829473
      2020   9720846  4732275  4988571   94.862336
인천광역시 2010   2758296  1390356  1367940  101.638668
      2020   2947217  1476813  1470404  100.435867

In [165]:
korea_mdf.unstack(level=0) #level 0에 해당하는 행정구역 인덱스 해제

         총인구수                                                 남자인구수            \
행정구역    광주광역시    대구광역시    대전광역시    부산광역시     서울특별시    인천광역시   광주광역시     대구광역시
년도
2010  1454636  2511676  1503664  2567910  10312545  2758296  721780  12552455
2020  1455048  2427954  1471040  3404423   9720846  2947217  720060   1198815

                       ...   여자인구수                                  남여비율  \
행정구역   대전광역시    부산광역시  ...   대전광역시    부산광역시    서울특별시    인천광역시      광주광역시
년도                     ...
2010  753648  1773170  ...  750016  1794740  5201286  1367940  98.488653
2020  734441  1668618  ...  736599  1735805  4988571  1470404  97.968946


행정구역       대구광역시       대전광역시      부산광역시      서울특별시       인천광역시
년도
2010  999.056454  100.484256  98.798155   9.829473  101.638668
2020   97.532907   99.707032  96.129346  94.862336  100.435867

[2 rows x 24 columns]

In [166]:
korea_mdf.unstack(level=1) #level 1에 해당하는 년도 인덱스 해제

           총인구수              남자인구수             여자인구수                 남여비율  \
년도         2010     2020      2010     2020     2010     2020        2010
행정구역
광주광역시   1454636  1455048    721780   720060   732856   734988   98.488653
대구광역시   2511676  2427954  12552455  1198815  1256431  1229139  999.056454
대전광역시   1503664  1471040    753648   734441   750016   736599  100.484256
부산광역시   2567910  3404423   1773170  1668618  1794740  1735805   98.798155
서울특별시  10312545  9720846    511259  4732275  5201286  4988571    9.829473
인천광역시   2758296  2947217   1390356  1476813  1367940  1470404  101.638668


년도           2020
행정구역
광주광역시   97.968946
대구광역시   97.532907
대전광역시   99.707032
부산광역시   96.129346
서울특별시   94.862336
인천광역시  100.435867

In [168]:
korea_mdf.stack()

행정구역   년도
광주광역시  2010  총인구수     1.454636e+06
             남자인구수    7.217800e+05
             여자인구수    7.328560e+05
             남여비율     9.848865e+01
       2020  총인구수     1.455048e+06
             남자인구수    7.200600e+05
             여자인구수    7.349880e+05
             남여비율     9.796895e+01
대구광역시  2010  총인구수     2.511676e+06
             남자인구수    1.255246e+07
             여자인구수    1.256431e+06
             남여비율     9.990565e+02
       2020  총인구수     2.427954e+06
             남자인구수    1.198815e+06
             여자인구수    1.229139e+06
             남여비율     9.753291e+01
대전광역시  2010  총인구수     1.503664e+06
             남자인구수    7.536480e+05
             여자인구수    7.500160e+05
             남여비율     1.004843e+02
       2020  총인구수     1.471040e+06
             남자인구수    7.344410e+05
             여자인구수    7.365990e+05
             남여비율     9.970703e+01
부산광역시  2010  총인구수     2.567910e+06
             남자인구수    1.773170e+06
             여자인구수    1.794740e+06
             남여비율     9.879815e+01
       2020  총인구수     3.404423e+06
             남자인구수    1.668618e+06
             여자인구수    1.735805e+06
             남여비율     9.612935e+01
서울특별시  2010  총인구수     1.031254e+07
             남자인구수    5.112590e+05
             여자인구수    5.201286e+06
             남여비율     9.829473e+00
       2020  총인구수     9.720846e+06
             남자인구수    4.732275e+06
             여자인구수    4.988571e+06
             남여비율     9.486234e+01
인천광역시  2010  총인구수     2.758296e+06
             남자인구수    1.390356e+06
             여자인구수    1.367940e+06
             남여비율     1.016387e+02
       2020  총인구수     2.947217e+06
             남자인구수    1.476813e+06
             여자인구수    1.470404e+06
             남여비율     1.004359e+02
dtype: float64

In [169]:
korea_mdf

                총인구수     남자인구수    여자인구수        남여비율
행정구역  년도
광주광역시 2010   1454636    721780   732856   98.488653
      2020   1455048    720060   734988   97.968946
대구광역시 2010   2511676  12552455  1256431  999.056454
      2020   2427954   1198815  1229139   97.532907
대전광역시 2010   1503664    753648   750016  100.484256
      2020   1471040    734441   736599   99.707032
부산광역시 2010   2567910   1773170  1794740   98.798155
      2020   3404423   1668618  1735805   96.129346
서울특별시 2010  10312545    511259  5201286    9.829473
      2020   9720846   4732275  4988571   94.862336
인천광역시 2010   2758296   1390356  1367940  101.638668
      2020   2947217   1476813  1470404  100.435867

In [170]:
#다중인덱스를 리셋시켜줬다
idx_flat = korea_mdf.reset_index(level=0) #행정구역 인덱스 리셋
idx_flat

       행정구역      총인구수     남자인구수    여자인구수        남여비율
년도
2010  광주광역시   1454636    721780   732856   98.488653
2020  광주광역시   1455048    720060   734988   97.968946
2010  대구광역시   2511676  12552455  1256431  999.056454
2020  대구광역시   2427954   1198815  1229139   97.532907
2010  대전광역시   1503664    753648   750016  100.484256
2020  대전광역시   1471040    734441   736599   99.707032
2010  부산광역시   2567910   1773170  1794740   98.798155
2020  부산광역시   3404423   1668618  1735805   96.129346
2010  서울특별시  10312545    511259  5201286    9.829473
2020  서울특별시   9720846   4732275  4988571   94.862336
2010  인천광역시   2758296   1390356  1367940  101.638668
2020  인천광역시   2947217   1476813  1470404  100.435867

In [172]:
idx_flat = korea_mdf.reset_index(level=(0,1)) #행정구역, 년도 인덱스 리셋
idx_flat

     행정구역    년도      총인구수     남자인구수    여자인구수        남여비율
0   광주광역시  2010   1454636    721780   732856   98.488653
1   광주광역시  2020   1455048    720060   734988   97.968946
2   대구광역시  2010   2511676  12552455  1256431  999.056454
3   대구광역시  2020   2427954   1198815  1229139   97.532907
4   대전광역시  2010   1503664    753648   750016  100.484256
5   대전광역시  2020   1471040    734441   736599   99.707032
6   부산광역시  2010   2567910   1773170  1794740   98.798155
7   부산광역시  2020   3404423   1668618  1735805   96.129346
8   서울특별시  2010  10312545    511259  5201286    9.829473
9   서울특별시  2020   9720846   4732275  4988571   94.862336
10  인천광역시  2010   2758296   1390356  1367940  101.638668
11  인천광역시  2020   2947217   1476813  1470404  100.435867

In [173]:
idx_flat.set_index(['행정구역','년도'])

                총인구수     남자인구수    여자인구수        남여비율
행정구역  년도
광주광역시 2010   1454636    721780   732856   98.488653
      2020   1455048    720060   734988   97.968946
대구광역시 2010   2511676  12552455  1256431  999.056454
      2020   2427954   1198815  1229139   97.532907
대전광역시 2010   1503664    753648   750016  100.484256
      2020   1471040    734441   736599   99.707032
부산광역시 2010   2567910   1773170  1794740   98.798155
      2020   3404423   1668618  1735805   96.129346
서울특별시 2010  10312545    511259  5201286    9.829473
      2020   9720846   4732275  4988571   94.862336
인천광역시 2010   2758296   1390356  1367940  101.638668
      2020   2947217   1476813  1470404  100.435867

In [174]:
##1시간 13분